In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

/home/ghezae/anaconda3/lib/python3.6/site-packages/matplotlib/font_manager.py:278: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  'Matplotlib is building the font cache using fc-list. '

In [3]:
s = pd.Series ([1,2,4,np.nan, 6,7])
s

0    1.0
1    2.0
2    4.0
3    NaN
4    6.0
5    7.0
dtype: float64

In [4]:
dates=pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df=pd.DataFrame(np.random.rand(6,4), index= dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.201457  0.550663  0.988095  0.806279
2013-01-02  0.733113  0.173141  0.535522  0.052396
2013-01-03  0.207784  0.833755  0.911947  0.040930
2013-01-04  0.815240  0.591451  0.588208  0.289648
2013-01-05  0.940893  0.217083  0.519410  0.531891
2013-01-06  0.167708  0.085827  0.612946  0.592438

In [13]:
df2=pd.DataFrame({'A':1.,
                 'B':pd.Timestamp('20130102'),
                 'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                 'D':np.array([3] * 4, dtype='int32'),
                 'E':pd.Categorical(['test','train', 'test','train']),
                 'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.values

array([[0.20145724, 0.55066283, 0.98809475, 0.806279  ],
       [0.73311297, 0.17314068, 0.5355219 , 0.05239604],
       [0.20778369, 0.83375492, 0.9119475 , 0.0409304 ],
       [0.81523976, 0.59145114, 0.58820779, 0.28964787],
       [0.94089317, 0.21708253, 0.51941034, 0.53189083],
       [0.16770753, 0.08582667, 0.61294591, 0.59243844]])

In [25]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.511032  0.408653  0.692688  0.385597
std    0.355615  0.293488  0.203637  0.309898
min    0.167708  0.085827  0.519410  0.040930
25%    0.203039  0.184126  0.548693  0.111709
50%    0.470448  0.383873  0.600577  0.410769
75%    0.794708  0.581254  0.837197  0.577302
max    0.940893  0.833755  0.988095  0.806279

In [26]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.201457    0.733113    0.207784    0.815240    0.940893    0.167708
B    0.550663    0.173141    0.833755    0.591451    0.217083    0.085827
C    0.988095    0.535522    0.911947    0.588208    0.519410    0.612946
D    0.806279    0.052396    0.040930    0.289648    0.531891    0.592438

In [27]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.806279  0.988095  0.550663  0.201457
2013-01-02  0.052396  0.535522  0.173141  0.733113
2013-01-03  0.040930  0.911947  0.833755  0.207784
2013-01-04  0.289648  0.588208  0.591451  0.815240
2013-01-05  0.531891  0.519410  0.217083  0.940893
2013-01-06  0.592438  0.612946  0.085827  0.167708

In [28]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01  0.201457  0.550663  0.988095  0.806279
2013-01-02  0.733113  0.173141  0.535522  0.052396
2013-01-03  0.207784  0.833755  0.911947  0.040930
2013-01-04  0.815240  0.591451  0.588208  0.289648
2013-01-05  0.940893  0.217083  0.519410  0.531891
2013-01-06  0.167708  0.085827  0.612946  0.592438

In [29]:
df['A']

2013-01-01    0.201457
2013-01-02    0.733113
2013-01-03    0.207784
2013-01-04    0.815240
2013-01-05    0.940893
2013-01-06    0.167708
Freq: D, Name: A, dtype: float64

In [30]:
df[0:3]

                   A         B         C         D
2013-01-01  0.201457  0.550663  0.988095  0.806279
2013-01-02  0.733113  0.173141  0.535522  0.052396
2013-01-03  0.207784  0.833755  0.911947  0.040930

In [31]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.733113  0.173141  0.535522  0.052396
2013-01-03  0.207784  0.833755  0.911947  0.040930
2013-01-04  0.815240  0.591451  0.588208  0.289648

In [32]:
df.loc[dates[0]]

A    0.201457
B    0.550663
C    0.988095
D    0.806279
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.201457  0.550663
2013-01-02  0.733113  0.173141
2013-01-03  0.207784  0.833755
2013-01-04  0.815240  0.591451
2013-01-05  0.940893  0.217083
2013-01-06  0.167708  0.085827

In [34]:
df.loc['20130102', ['A', 'B']]

A    0.733113
B    0.173141
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
df.loc[dates[0], 'A']

0.20145723892167067

In [36]:
df.at[dates[0], 'A']

0.20145723892167067

In [37]:
df.iloc[3]

A    0.815240
B    0.591451
C    0.588208
D    0.289648
Name: 2013-01-04 00:00:00, dtype: float64

In [38]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.733113  0.535522
2013-01-03  0.207784  0.911947
2013-01-05  0.940893  0.519410

In [39]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.733113  0.173141  0.535522  0.052396
2013-01-03  0.207784  0.833755  0.911947  0.040930

In [40]:
df.iloc[1,1]

0.17314067519887855

In [42]:
df[df.A>0.5]

                   A         B         C         D
2013-01-02  0.733113  0.173141  0.535522  0.052396
2013-01-04  0.815240  0.591451  0.588208  0.289648
2013-01-05  0.940893  0.217083  0.519410  0.531891

In [43]:
df2=df.copy()

In [44]:
 df2['E'] = ['one', 'one','two','three','four','three']

In [45]:
df2

                   A         B         C         D      E
2013-01-01  0.201457  0.550663  0.988095  0.806279    one
2013-01-02  0.733113  0.173141  0.535522  0.052396    one
2013-01-03  0.207784  0.833755  0.911947  0.040930    two
2013-01-04  0.815240  0.591451  0.588208  0.289648  three
2013-01-05  0.940893  0.217083  0.519410  0.531891   four
2013-01-06  0.167708  0.085827  0.612946  0.592438  three

In [49]:
s1= pd.Series([1,2,3,4,5,6], index=pd.date_range('20120101', periods=6))
s1

2012-01-01    1
2012-01-02    2
2012-01-03    3
2012-01-04    4
2012-01-05    5
2012-01-06    6
Freq: D, dtype: int64

In [52]:
df['F']=s1

In [53]:
df

                   A         B         C         D   F
2013-01-01  0.201457  0.550663  0.988095  0.806279 NaN
2013-01-02  0.733113  0.173141  0.535522  0.052396 NaN
2013-01-03  0.207784  0.833755  0.911947  0.040930 NaN
2013-01-04  0.815240  0.591451  0.588208  0.289648 NaN
2013-01-05  0.940893  0.217083  0.519410  0.531891 NaN
2013-01-06  0.167708  0.085827  0.612946  0.592438 NaN

In [54]:
df1=df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D   F    E
2013-01-01  0.201457  0.550663  0.988095  0.806279 NaN  1.0
2013-01-02  0.733113  0.173141  0.535522  0.052396 NaN  1.0
2013-01-03  0.207784  0.833755  0.911947  0.040930 NaN  NaN
2013-01-04  0.815240  0.591451  0.588208  0.289648 NaN  NaN

In [55]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [58]:
df1[df1['E'].notnull()]

                   A         B         C         D   F    E
2013-01-01  0.201457  0.550663  0.988095  0.806279 NaN  1.0
2013-01-02  0.733113  0.173141  0.535522  0.052396 NaN  1.0

In [60]:
del df1['F']

In [61]:
df1

                   A         B         C         D    E
2013-01-01  0.201457  0.550663  0.988095  0.806279  1.0
2013-01-02  0.733113  0.173141  0.535522  0.052396  1.0
2013-01-03  0.207784  0.833755  0.911947  0.040930  NaN
2013-01-04  0.815240  0.591451  0.588208  0.289648  NaN

In [63]:
 s= pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [64]:
df.sub(s, axis='index')

                   A         B         C         D   F
2013-01-01       NaN       NaN       NaN       NaN NaN
2013-01-02       NaN       NaN       NaN       NaN NaN
2013-01-03 -0.792216 -0.166245 -0.088053 -0.959070 NaN
2013-01-04 -2.184760 -2.408549 -2.411792 -2.710352 NaN
2013-01-05 -4.059107 -4.782917 -4.480590 -4.468109 NaN
2013-01-06       NaN       NaN       NaN       NaN NaN